/*********************************************************************

Тестирование OLED - дисплея в графическом режиме
Монохромный дисплей
Крайний левый бит в строке - младший бит младшего байта
Крайний првый бит в строке - старший бит старшего байта

Эмуляция стрелочного прибора
Отображает значение входного сигнала в диапазоне от 0 до 10 с дискретом, равным 1
*********************************************************************/
#include "sScreen.h"
#include "sDevice.h"
#include "sControl.h"

//=========================================================================
// КОНСТАНТЫ
//=========================================================================
#define COUNTER_DWELL 100

//=========================================================================
// ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ
//=========================================================================
OLED  myOLED(SDA, SCL, 7);
sControl Control;
sDevice Device;

extern uint8_t SmallFont[];
extern uint8_t RusFont[];

//=====================================================================================
// Программа начальной установки
//=====================================================================================
void setup()
{                
  Screen.LeftMargin = 5;
   
  myOLED.begin();
  myOLED.setFont(SmallFont);

  myOLED.clrScr();
  myOLED.update();

  Device.Value = 100;
  
}//End of void setup()


//=====================================================================================
// Главный цикл программы
//=====================================================================================
void loop() {
  Control.exec(COUNTER_DWELL);

}//End of void loop()

